# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 2 # number of classes
depth_multiple: 0.33 # scales module repeats
width_multiple: 0.25  # scales convolution channels

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4  11
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]  # cat backbone 14
  - [-1, 3, C2f, [256]]  # 17 (P3/8-small)15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]# 16
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P3 17
  - [-1, 3, C2f, [128]]  # 20 (P4/16-medium)  18

  - [-1, 1, Conv, [256, 3, 2]]  # 19
  - [[-1, 15], 1, Concat, [1]]  # cat head P4  20
  - [-1, 3, C2f, [256]]  # 20 (P4/16-medium)  21

  - [-1, 1, Conv, [512, 3, 2]]  # 22
  - [[-1, 12], 1, Concat, [1]]  # cat head P5  23
  - [-1, 3, C2f, [512]]  # 23 (P5/32-large)  24

  - [-1, 1, Conv, [512, 3, 2]]  # 25
  - [[-1, 9], 1, Concat, [1]]  # cat head P5  26
  - [-1, 3, C2f, [1024]]  # 23 (P5/32-large)  27

  - [[18, 21, 24,27], 1, Detect, [nc]]  # Detect(P3, P4, P5)



